# GetViewIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewsExportingByContextEventArgs..::..GetViewIds Method
ViewsExportingByContextEventArgs Class See Also
---
Gets the views about to be exported by CustomExporter.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public IList<ElementId> GetViewIds()
```

Visual Basic
---
```text
Public Function GetViewIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetViewIds()
```

# ### Return Value
The views about to be exported by CustomExporter.
# See Also
ViewsExportingByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace